In [1]:
# Importing Libraries
import numpy as np
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

/opt/anaconda3/envs/python_course/lib/python3.12/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

Filling none values with mean and median values

In [9]:
median_salary_year= df['salary_year_avg'].median()
median_salary_year

115000.0

In [18]:
mean_salary_hour=df['salary_hour_avg'].mean()
mean_salary_hour

47.01659821515861

In [19]:
df_filled =df

df_filled['salary_year_avg']=df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg']=df_filled['salary_hour_avg'].fillna(mean_salary_hour)

In [23]:
df_filled.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0        47.016598
1          115000.0        47.016598
2          115000.0        47.016598
3          115000.0        47.016598
4          115000.0        47.016598
5          115000.0        47.016598
6          115000.0        47.016598
7          115000.0        47.016598
8          115000.0        47.016598
9          115000.0        47.016598
10         115000.0        47.016598

Droping duplicates

In [63]:
df_unique=df_filled

In [64]:
df_unique=df_unique.drop_duplicates()


print("length of orginal df             ",len(df_filled))
print("Length of droped duplicates df   ",len(df_unique))
print("rows dropped                     ",len(df_filled)-len(df_unique))

length of orginal df              785741
Length of droped duplicates df    785640
rows dropped                      101

In [65]:
df.loc[0:2]

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,115000.0,47.016598,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,115000.0,47.016598,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,115000.0,47.016598,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."

In [57]:
df_unique= df_unique.drop_duplicates(subset=['job_title','company_name'])

print("length of orginal df             ",len(df_filled))
print("Length of droped duplicates df   ",len(df_unique))
print("rows dropped                     ",len(df_filled)-len(df_unique))

length of orginal df              785741
Length of droped duplicates df    508042
rows dropped                      277699